#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/DevopsFiapSoat3-G35/postech-fase-5-pedido-db/runs/run-1LjuFkgWJmyZft4G

Waiting for the plan to start...

Terraform v1.8.3
on linux_amd64
Initializing plugins and modules...
aws_db_subnet_group.paciente: Refreshing state... [id=paciente]
data.aws_vpc.selected: Refreshing...
data.aws_vpc.selected: Refresh complete after 0s [id=vpc-02aea9fd78c258127]
data.aws_subnet_ids.example: Refreshing...
data.aws_subnet_ids.example: Refresh complete after 0s [id=vpc-02aea9fd78c258127]
data.aws_subnet.example["subnet-0ae9622179effb960"]: Refreshing...
data.aws_subnet.example["subnet-0a6fc9df9bba71806"]: Refreshing...
data.aws_subnet.example["subnet-06019970593165d3c"]: Refreshing...
data.aws_subnet.example["subnet-093f09948e8e5d0d8"]: Refreshing...
data.aws_subnet.example["subnet-0c25187809549b1ca"]: Refreshing...
data.aws_subnet.example["subnet-028e58e6c6c9d9818"]: Refreshing...
data.aws_subnet.example["subnet-0ae9622179effb960"]: Refresh complete after 1s [id=subnet-0ae9622179effb960]
data.aws_subnet.example["subnet-06019970593165d3c"]: Refresh complete after 1s [id=subnet-06019970593165d3c]
data.aws_subnet.example["subnet-0c25187809549b1ca"]: Refresh complete after 1s [id=subnet-0c25187809549b1ca]
data.aws_subnet.example["subnet-0a6fc9df9bba71806"]: Refresh complete after 1s [id=subnet-0a6fc9df9bba71806]
data.aws_subnet.example["subnet-093f09948e8e5d0d8"]: Refresh complete after 1s [id=subnet-093f09948e8e5d0d8]
data.aws_subnet.example["subnet-028e58e6c6c9d9818"]: Refresh complete after 1s [id=subnet-028e58e6c6c9d9818]
aws_db_subnet_group.paciente: Drift detected (update)
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "AWS_ACCESS_KEY_ID" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-1LjuFkgWJmyZft4G/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "AWS_SECRET_ACCESS_KEY"
│ but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-1LjuFkgWJmyZft4G/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_db_instance.pedido will be created
  + resource "aws_db_instance" "pedido" {
      + address                               = (known after apply)
      + allocated_storage                     = 5
      + apply_immediately                     = (known after apply)
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_subnet_group_name                  = "pedido"
      + delete_automated_backups              = true
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_version                        = "14.11"
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "pedido"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + maintenance_window                    = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + name                                  = "pedido"
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = true
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_type                          = (known after apply)
      + tags                                  = {
          + "Name" = "PedidoPostgresDB"
        }
      + timezone                              = (known after apply)
      + username                              = "postgres"
      + vpc_security_group_ids                = (known after apply)
    }

  # aws_db_subnet_group.paciente will be destroyed
  - resource "aws_db_subnet_group" "paciente" {
      - arn         = "arn:aws:rds:us-east-1:471112887467:subgrp:paciente" -> null
      - description = "Managed by Terraform" -> null
      - id          = "paciente" -> null
      - name        = "paciente" -> null
      - subnet_ids  = [
          - "subnet-004c4f9da43f73250",
          - "subnet-091b3f99272742dd9",
          - "subnet-09c2c76dc12c5b54d",
          - "subnet-0a45fcd77471a76c2",
          - "subnet-0b441cd402ae3b5ee",
          - "subnet-0ccc17cbf09dbc88d",
        ] -> null
      - tags        = {
          - "Name" = "Paciente"
        } -> null
    }

  # aws_db_subnet_group.pedido will be created
  + resource "aws_db_subnet_group" "pedido" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "pedido"
      + name_prefix = (known after apply)
      + subnet_ids  = [
          + "subnet-028e58e6c6c9d9818",
          + "subnet-06019970593165d3c",
          + "subnet-093f09948e8e5d0d8",
          + "subnet-0a6fc9df9bba71806",
          + "subnet-0ae9622179effb960",
          + "subnet-0c25187809549b1ca",
        ]
      + tags        = {
          + "Name" = "Pedido"
        }
    }

  # aws_security_group.instance will be created
  + resource "aws_security_group" "instance" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 5432
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = "postgres-security-group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = "vpc-02aea9fd78c258127"
    }

Plan: 3 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + rds_hostname       = (sensitive value)
  + rds_port           = (sensitive value)
  ~ subnet_cidr_blocks = [
      - "10.0.3.0/24",
      - "10.0.6.0/24",
      - "10.0.2.0/24",
        "10.0.4.0/24",
      - "10.0.5.0/24",
        "10.0.1.0/24",
      + "10.0.2.0/24",
      + "10.0.6.0/24",
      + "10.0.5.0/24",
      + "10.0.3.0/24",
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @alinedonatoc, Action: `pull_request`*